docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.org
#+TITLE: Install Wine On RHEL 8.3
#+AUTHOR: Taylor Shin
#+OPTIONS: toc:2
#+STARTUP: showeverything
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Wine on RHEL
** Main motivation
We need to run some Windows tools on Linux since not a lot of Windows simulation tools are ported or written for UNIX system or similar OS.
Good thing is, those circuit simulators are not so graphics intensive. Thus, they must be easier to run than most of Steam games.

Let's start installing Wine emulator, then!!

