docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-12 Mon 22:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Install Wine On RHEL 8.3</title>
<meta name="author" content="Taylor Shin" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Install Wine On RHEL 8.3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org47bc631">1. Wine on RHEL</a>
<ul>
<li><a href="#orgefc48e2">1.1. Main motivation</a></li>
<li><a href="#org3ed6b90">1.2. Initial Set-Up with DNF</a></li>
<li><a href="#org69a6854">1.3. Downloading Wine</a></li>
<li><a href="#orgb49c950">1.4. Compiling Wine</a></li>
<li><a href="#orge7a3534">1.5. Wine Gecko and Mono</a></li>
<li><a href="#orgc172d2b">1.6. Closing up</a></li>
</ul>
</li>
<li><a href="#org70c95a4">2. Winetricks</a></li>
<li><a href="#org762a846">3. Korean Fonts</a></li>
</ul>
</div>
</div>

<div id="outline-container-org47bc631" class="outline-2">
<h2 id="org47bc631"><span class="section-number-2">1</span> Wine on RHEL</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgefc48e2" class="outline-3">
<h3 id="orgefc48e2"><span class="section-number-3">1.1</span> Main motivation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We need to run some Windows tools on Linux since not a lot of Windows simulation tools are ported or written for UNIX system or similar OS.
Good thing is, those circuit simulators are not so graphics intensive. Thus, they must be easier to run than most of Steam games.
</p>

<p>
Let&rsquo;s start installing Wine emulator, then!!
</p>
</div>
</div>
