docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.html

<div id="outline-container-org3ed6b90" class="outline-3">
<h3 id="org3ed6b90"><span class="section-number-3">1.2</span> Initial Set-Up with DNF</h3>
<div class="outline-text-3" id="text-1-2">
<p>
As we know, building everything from scratch is not a solid way to go, especially on somewhat established environment such as RHEL or CentOS. However, those distributions do not provide state-of-art Wine in their repositories for some weird reason. Stability? What stability do you need with a Windows emulator?
</p>

<p>
So, it is obvious we need to set up some method to actually &rsquo;compile&rsquo; Wine codes. But compiling every single line of codes of dependency libraries is a time-consuming and head bonking job. These steps are adopted from <a href="https://www.tecmint.com/install-wine-in-rhel-centos-and-fedora/">Techmint.com&rsquo;s guide</a> and <a href="https://github.com/zma/usefulscripts/blob/master/script/install-wine-i686-centos8.sh">SysTutorials.com</a>.
</p>

<p>
Thus, let&rsquo;s start with installing some baseline libraries&#x2026;
</p>

<p>
The Wine version will not be so state-of-art since we need to ensure other important packages to catch up: such as <a href="https://wiki.winehq.org/Mono">Wine-mono</a> and <a href="https://wiki.winehq.org/Gecko">Wine-gecko</a>.
</p>

<p>
Wine version:
</p>
<div class="org-src-container">
<pre class="src src-string" id="org5ad0371">5.0
</pre>
</div>

<p>
The preamble part is here:
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org8f54a76"><span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">!/usr/bin/</span><span style="color: #859900; font-weight: bold;">env</span><span style="color: #96A7A9; font-style: italic;"> bash -e</span>
<span style="color: #268bd2;">CWD</span>=<span style="color: #2aa198;">"</span><span style="color: #268bd2; font-weight: bold;">$(</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">pwd</span><span style="color: #268bd2; font-weight: bold;"> -P)</span><span style="color: #2aa198;">"</span>
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #268bd2; font-weight: bold;">!</span> -d <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{CWD}</span><span style="color: #2aa198;">/workspace"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">mkdir</span> -pv <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{CWD}</span><span style="color: #2aa198;">/workspace"</span>
<span style="color: #859900; font-weight: bold;">fi</span>
<span style="color: #268bd2;">WORKSPACE</span>=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{CWD}</span><span style="color: #2aa198;">/workspace"</span>
<span style="color: #268bd2;">WINE_VER</span>=<span style="color: #2aa198;">"5.0"</span>
<span style="color: #268bd2;">WINE_VER_MAJOR</span>=$<span style="color: #268bd2;">(</span><span style="color: #b58900; font-style: italic;">echo</span> $<span style="color: #d33682;">{</span><span style="color: #268bd2;">WINE_VER</span><span style="color: #d33682;">}</span> | cut -d<span style="color: #2aa198;">'.'</span> -f1<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">WINE_VER_URL</span>=$<span style="color: #268bd2;">(</span><span style="color: #b58900; font-style: italic;">echo</span> $<span style="color: #d33682;">{</span><span style="color: #268bd2;">WINE_VER</span><span style="color: #d33682;">}</span> | cut -d<span style="color: #2aa198;">'.'</span> -f1,2<span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">log</span>=<span style="color: #2aa198;">"</span><span style="color: #268bd2; font-weight: bold;">$(mktemp -t install-wine.XXXXXX.log)</span><span style="color: #2aa198;">"</span>

<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">Checking for wget</span>
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #268bd2; font-weight: bold;">!</span> -x <span style="color: #2aa198;">"</span><span style="color: #268bd2; font-weight: bold;">$(command -v wget)</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Oops! wget is a must!!"</span>
    <span style="color: #859900; font-weight: bold;">exit</span> <span style="color: #6c71c4; font-weight: bold;">1</span>
<span style="color: #859900; font-weight: bold;">fi</span>
</pre>
</div>

<p>
In fact, we can skip all those pesky package installation stuff once we have done it! So, let&rsquo;s implement some argument to avoid this time consuming crap.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #268bd2;">compile_only</span>=<span style="color: #2aa198;">"false"</span>
<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">if [ $# -ne 0 ]; then</span>
<span style="color: #96A7A9; font-style: italic;">#     </span><span style="color: #96A7A9; font-style: italic;">if [ "$1" = "compile_only" ]; then</span>
<span style="color: #96A7A9; font-style: italic;">#         </span><span style="color: #96A7A9; font-style: italic;">compile_only="true"</span>
<span style="color: #96A7A9; font-style: italic;">#     </span><span style="color: #96A7A9; font-style: italic;">fi</span>
<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">fi</span>
<span style="color: #b58900;">usage</span> <span style="color: #268bd2;">()</span> <span style="color: #268bd2;">{</span>
    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">""</span>
    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Options are: compile_only"</span>
<span style="color: #268bd2;">}</span>

<span style="color: #859900; font-weight: bold;">while</span> <span style="color: #268bd2;">[</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">1</span><span style="color: #2aa198;">"</span> != <span style="color: #2aa198;">""</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">do</span>
    <span style="color: #268bd2;">PARAM</span>=<span style="color: #268bd2; font-weight: bold;">`</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">echo</span><span style="color: #268bd2; font-weight: bold;"> $1 | awk -F= '{print $1}'`</span>
    <span style="color: #268bd2;">VALUE</span>=<span style="color: #268bd2; font-weight: bold;">`</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">echo</span><span style="color: #268bd2; font-weight: bold;"> $1 | awk -F= '{print $2}'`</span>

    <span style="color: #859900; font-weight: bold;">case</span> $<span style="color: #268bd2;">PARAM</span><span style="color: #859900; font-weight: bold;"> in</span>
        -h | --help)
            usage
            <span style="color: #859900; font-weight: bold;">exit</span>
            ;;
        compile_only)
            <span style="color: #268bd2;">compile_only</span>=<span style="color: #2aa198;">"true"</span>
            ;;
        *)
            <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Error! Unknown Parameter!!"</span>
            usage
            <span style="color: #859900; font-weight: bold;">exit</span> <span style="color: #6c71c4; font-weight: bold;">1</span>
            ;;
    <span style="color: #859900; font-weight: bold;">esac</span>
    <span style="color: #d33682; font-style: italic;">shift</span>
<span style="color: #859900; font-weight: bold;">done</span>

</pre>
</div>


<p>
Now, the baseline libraries&#x2026; This takes a lot of time. Also, there is a bit of diffeerence between RHEL8 and CentOS.
</p>
<div class="org-src-container">
<pre class="src src-shell" id="orged5e89a">
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">compile_only</span><span style="color: #2aa198;">"</span> = <span style="color: #2aa198;">"false"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Installing prerequisite packages..."</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://dl.fedoraproject.org/pub/epel/epel-release-latest-8.noarch.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H subscription-manager repos --enable <span style="color: #2aa198;">"codeready-builder-for-rhel-8-x86_64-rpms"</span>
    <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">sudo</span><span style="color: #96A7A9; font-style: italic;"> -H dnf config-manager --set-enable PowerTools 2&gt;&amp;1 &gt;&gt;$log # CentOS8</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H rpm --import http://li.nux.ro/download/nux/RPM-GPG-KEY-nux.ro <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://li.nux.ro/download/nux/dextop/el7/x86_64/nux-dextop-release-0-5.el7.nux.noarch.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf clean all <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf update --best --allowerasing -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Removing wine from official repo."</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf remove wine wine-* -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install libjpeg-turbo-devel libtiff-devel freetype-devel -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install glibc-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libgcc.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libX11-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> freetype-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> gnutls-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libxml2-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libjpeg-turbo-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libpng-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libXrender-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> alsa-lib-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> glib2-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libSM-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
<span style="color: #859900; font-weight: bold;">fi</span>
</pre>
</div>

<p>
Some packages needs custom repo installation. They were available on RHEL 7 or CentOS 7 but discontinued on 8. This is why many institutions do not migrate to newest distributions easily.
</p>

<ol class="org-ol">
<li>isdn4k-utils-devel.i686</li>
<li>pkgconfig.i686</li>
<li>audiofile-devel.i686</li>
<li>qt-devel.i686</li>
</ol>

<p>
They will be installed manually&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org7a5b41f">
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">compile_only</span><span style="color: #2aa198;">"</span> = <span style="color: #2aa198;">"false"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Installing some edge case 32bit packages..."</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/prelink-0.5.0-9.el7.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/isdn4k-utils-3.2-99.el7.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/isdn4k-utils-devel-3.2-99.el7.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install glibc-devel libstdc++-devel icoutils openal-soft-devel prelink gstreamer1-plugins-base-devel gstreamer1-devel ImageMagick-devel fontpackages-devel libv4l-devel gsm-devel giflib-devel libXxf86dga-devel mesa-libOSMesa-devel isdn4k-utils-devel libgphoto2-devel fontforge libusb-devel lcms2-devel audiofile-devel -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/isdn4k-utils-3.2-99.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/isdn4k-utils-devel-3.2-99.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/audiofile-0.3.6-9.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/audiofile-devel-0.3.6-9.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/qt-4.8.7-8.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/libmng-1.0.10-14.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/qt-x11-4.8.7-8.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/qt-devel-4.8.7-8.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/8/AppStream/x86_64/os/Packages/vulkan-loader-devel-1.2.148.0-1.el8.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/8/PowerTools/x86_64/os/Packages/mpg123-devel-1.25.10-2.el8.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/extras/x86_64/libvkd3d-1.1-3.el8.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/extras/x86_64/libvkd3d-devel-1.1-3.el8.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/multimedia/x86_64/libFAudio-20.07-1.el8.8_2.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/multimedia/x86_64/libFAudio-devel-20.07-1.el8.8_2.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/multimedia/x86_64/libFAudio-20.07-1.el8.8_2.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/multimedia/x86_64/libFAudio-devel-20.07-1.el8.8_2.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install glibc-devel.i686 dbus-devel.i686 freetype-devel.i686 pulseaudio-libs-devel.i686 libX11-devel.i686 mesa-libGLU-devel.i686 libICE-devel.i686 libXext-devel.i686 libXcursor-devel.i686 libXi-devel.i686 libXxf86vm-devel.i686 libXrender-devel.i686 libXinerama-devel.i686 libXcomposite-devel.i686 libXrandr-devel.i686 mesa-libGL-devel.i686 mesa-libOSMesa-devel.i686 libxml2-devel.i686 zlib-devel.i686 gnutls-devel.i686 ncurses-devel.i686 sane-backends-devel.i686 libv4l-devel.i686 libgphoto2-devel.i686 libexif-devel.i686 lcms2-devel.i686 gettext-devel.i686 isdn4k-utils-devel.i686 cups-devel.i686 fontconfig-devel.i686 gsm-devel.i686 libjpeg-turbo-devel.i686 libtiff-devel.i686 unixODBC.i686 openldap-devel.i686 alsa-lib-devel.i686 audiofile-devel.i686 freeglut-devel.i686 giflib-devel.i686 gstreamer1-devel.i686 gstreamer1-plugins-base-devel.i686 libXmu-devel.i686 libXxf86dga-devel.i686 libieee1284-devel.i686 libpng-devel.i686 librsvg2-devel.i686 libstdc++-devel.i686 libusb-devel.i686 unixODBC-devel.i686 qt-devel.i686 libpcap-devel.i686 -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Resolving conflicts..."</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf clean all <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf update --best --allowerasing -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf builddep wine -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf update -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install gstreamer1-plugins-base-devel.<span style="color: #268bd2;">{</span>x86_64,i686<span style="color: #268bd2;">}</span> gstreamer1-devel.<span style="color: #268bd2;">{</span>x86_64,i686<span style="color: #268bd2;">}</span> systemd-devel.<span style="color: #268bd2;">{</span>x86_64,i686<span style="color: #268bd2;">}</span> -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install libXfixes-devel.<span style="color: #268bd2;">{</span>x86_64,i686<span style="color: #268bd2;">}</span> -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

<span style="color: #859900; font-weight: bold;">fi</span>
</pre>
</div>

<p>
Package installation part can be summarized as&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">!/usr/bin/</span><span style="color: #859900; font-weight: bold;">env</span><span style="color: #96A7A9; font-style: italic;"> bash -e</span>
<span style="color: #268bd2;">CWD</span>=<span style="color: #2aa198;">"</span><span style="color: #268bd2; font-weight: bold;">$(</span><span style="color: #268bd2; font-weight: bold; font-style: italic;">pwd</span><span style="color: #268bd2; font-weight: bold;"> -P)</span><span style="color: #2aa198;">"</span>
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #268bd2; font-weight: bold;">!</span> -d <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{CWD}</span><span style="color: #2aa198;">/workspace"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">mkdir</span> -pv <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{CWD}</span><span style="color: #2aa198;">/workspace"</span>
<span style="color: #859900; font-weight: bold;">fi</span>
<span style="color: #268bd2;">WORKSPACE</span>=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{CWD}</span><span style="color: #2aa198;">/workspace"</span>
<span style="color: #268bd2;">WINE_VER</span>=<span style="color: #2aa198;">"5.0"</span>
<span style="color: #268bd2;">WINE_VER_MAJOR</span>=$<span style="color: #268bd2;">(</span><span style="color: #b58900; font-style: italic;">echo</span> $<span style="color: #d33682;">{</span><span style="color: #268bd2;">WINE_VER</span><span style="color: #d33682;">}</span> | cut -d<span style="color: #2aa198;">'.'</span> -f1<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">WINE_VER_URL</span>=$<span style="color: #268bd2;">(</span><span style="color: #b58900; font-style: italic;">echo</span> $<span style="color: #d33682;">{</span><span style="color: #268bd2;">WINE_VER</span><span style="color: #d33682;">}</span> | cut -d<span style="color: #2aa198;">'.'</span> -f1,2<span style="color: #268bd2;">)</span>

<span style="color: #268bd2;">log</span>=<span style="color: #2aa198;">"</span><span style="color: #268bd2; font-weight: bold;">$(mktemp -t install-wine.XXXXXX.log)</span><span style="color: #2aa198;">"</span>

<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">Checking for wget</span>
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #268bd2; font-weight: bold;">!</span> -x <span style="color: #2aa198;">"</span><span style="color: #268bd2; font-weight: bold;">$(command -v wget)</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Oops! wget is a must!!"</span>
    <span style="color: #859900; font-weight: bold;">exit</span> <span style="color: #6c71c4; font-weight: bold;">1</span>
<span style="color: #859900; font-weight: bold;">fi</span>

<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">compile_only</span><span style="color: #2aa198;">"</span> = <span style="color: #2aa198;">"false"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Installing prerequisite packages..."</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://dl.fedoraproject.org/pub/epel/epel-release-latest-8.noarch.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H subscription-manager repos --enable <span style="color: #2aa198;">"codeready-builder-for-rhel-8-x86_64-rpms"</span>
    <span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">sudo</span><span style="color: #96A7A9; font-style: italic;"> -H dnf config-manager --set-enable PowerTools 2&gt;&amp;1 &gt;&gt;$log # CentOS8</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H rpm --import http://li.nux.ro/download/nux/RPM-GPG-KEY-nux.ro <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://li.nux.ro/download/nux/dextop/el7/x86_64/nux-dextop-release-0-5.el7.nux.noarch.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf clean all <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf update --best --allowerasing -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Removing wine from official repo."</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf remove wine wine-* -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install libjpeg-turbo-devel libtiff-devel freetype-devel -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install glibc-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libgcc.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libX11-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> freetype-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> gnutls-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libxml2-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libjpeg-turbo-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libpng-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libXrender-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> alsa-lib-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> glib2-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> libSM-devel.<span style="color: #268bd2;">{</span>i686,x86_64<span style="color: #268bd2;">}</span> -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
<span style="color: #859900; font-weight: bold;">fi</span>

<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">compile_only</span><span style="color: #2aa198;">"</span> = <span style="color: #2aa198;">"false"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Installing some edge case 32bit packages..."</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/prelink-0.5.0-9.el7.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/isdn4k-utils-3.2-99.el7.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/isdn4k-utils-devel-3.2-99.el7.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install glibc-devel libstdc++-devel icoutils openal-soft-devel prelink gstreamer1-plugins-base-devel gstreamer1-devel ImageMagick-devel fontpackages-devel libv4l-devel gsm-devel giflib-devel libXxf86dga-devel mesa-libOSMesa-devel isdn4k-utils-devel libgphoto2-devel fontforge libusb-devel lcms2-devel audiofile-devel -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/isdn4k-utils-3.2-99.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/isdn4k-utils-devel-3.2-99.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/audiofile-0.3.6-9.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/audiofile-devel-0.3.6-9.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/qt-4.8.7-8.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/libmng-1.0.10-14.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/qt-x11-4.8.7-8.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/7/os/x86_64/Packages/qt-devel-4.8.7-8.el7.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/8/AppStream/x86_64/os/Packages/vulkan-loader-devel-1.2.148.0-1.el8.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install http://mirror.centos.org/centos/8/PowerTools/x86_64/os/Packages/mpg123-devel-1.25.10-2.el8.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/extras/x86_64/libvkd3d-1.1-3.el8.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/extras/x86_64/libvkd3d-devel-1.1-3.el8.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/multimedia/x86_64/libFAudio-20.07-1.el8.8_2.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/multimedia/x86_64/libFAudio-devel-20.07-1.el8.8_2.i686.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/multimedia/x86_64/libFAudio-20.07-1.el8.8_2.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install https://pkgs.dyn.su/el8/multimedia/x86_64/libFAudio-devel-20.07-1.el8.8_2.x86_64.rpm -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install glibc-devel.i686 dbus-devel.i686 freetype-devel.i686 pulseaudio-libs-devel.i686 libX11-devel.i686 mesa-libGLU-devel.i686 libICE-devel.i686 libXext-devel.i686 libXcursor-devel.i686 libXi-devel.i686 libXxf86vm-devel.i686 libXrender-devel.i686 libXinerama-devel.i686 libXcomposite-devel.i686 libXrandr-devel.i686 mesa-libGL-devel.i686 mesa-libOSMesa-devel.i686 libxml2-devel.i686 zlib-devel.i686 gnutls-devel.i686 ncurses-devel.i686 sane-backends-devel.i686 libv4l-devel.i686 libgphoto2-devel.i686 libexif-devel.i686 lcms2-devel.i686 gettext-devel.i686 isdn4k-utils-devel.i686 cups-devel.i686 fontconfig-devel.i686 gsm-devel.i686 libjpeg-turbo-devel.i686 libtiff-devel.i686 unixODBC.i686 openldap-devel.i686 alsa-lib-devel.i686 audiofile-devel.i686 freeglut-devel.i686 giflib-devel.i686 gstreamer1-devel.i686 gstreamer1-plugins-base-devel.i686 libXmu-devel.i686 libXxf86dga-devel.i686 libieee1284-devel.i686 libpng-devel.i686 librsvg2-devel.i686 libstdc++-devel.i686 libusb-devel.i686 unixODBC-devel.i686 qt-devel.i686 libpcap-devel.i686 -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Resolving conflicts..."</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf clean all <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf update --best --allowerasing -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf builddep wine -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf update -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install gstreamer1-plugins-base-devel.<span style="color: #268bd2;">{</span>x86_64,i686<span style="color: #268bd2;">}</span> gstreamer1-devel.<span style="color: #268bd2;">{</span>x86_64,i686<span style="color: #268bd2;">}</span> systemd-devel.<span style="color: #268bd2;">{</span>x86_64,i686<span style="color: #268bd2;">}</span> -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

    <span style="color: #b58900; font-style: italic;">sudo</span> -H dnf install libXfixes-devel.<span style="color: #268bd2;">{</span>x86_64,i686<span style="color: #268bd2;">}</span> -y <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>

<span style="color: #859900; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
