docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.org
** Downloading Wine
Ok, we can download Wine source code from the official [[https://www.winehq.org/][Wine web site]].
#+begin_src shell :tangle Wine_on_RHEL.sh
DOWNLOADS="${WORKSPACE}/downloads"
if [ ! -d "$DOWNLOADS" ]; then
	mkdir -pv "${DOWNLOADS}"
fi
wget "http://dl.winehq.org/wine/source/${WINE_VER_URL}/wine-${WINE_VER}.tar.xz" -O "${DOWNLOADS}/wine-${WINE_VER}.tar.xz" 2>&1 >>$log
# Use this url for experimental version.
# wget "http://dl.winehq.org/wine/source/${WINE_VER_MAJOR}.x/wine-${WINE_VER}.tar.xz" -O
#+end_src

#+RESULTS:

Now, extract the tarball!
#+begin_src shell :tangle Wine_on_RHEL.sh
SRC_DIR="${WORKSPACE}/src"
if [ ! -d "${SRC_DIR}" ]; then
	mkdir -pv "${SRC_DIR}"
fi
tar xf "${DOWNLOADS}/wine-${WINE_VER}.tar.xz" -C "${SRC_DIR}"
WINE_SRC_DIR="${SRC_DIR}/wine-${WINE_VER}"
#+end_src

