docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.html

<div id="outline-container-org69a6854" class="outline-3">
<h3 id="org69a6854"><span class="section-number-3">1.3</span> Downloading Wine</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Ok, we can download Wine source code from the official <a href="https://www.winehq.org/">Wine web site</a>.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #268bd2;">DOWNLOADS</span>=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WORKSPACE}</span><span style="color: #2aa198;">/downloads"</span>
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #268bd2; font-weight: bold;">!</span> -d <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">DOWNLOADS</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">mkdir</span> -pv <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{DOWNLOADS}</span><span style="color: #2aa198;">"</span>
<span style="color: #859900; font-weight: bold;">fi</span>
wget <span style="color: #2aa198;">"http://dl.winehq.org/wine/source/</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_VER_URL}</span><span style="color: #2aa198;">/wine-</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_VER}</span><span style="color: #2aa198;">.tar.xz"</span> -O <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{DOWNLOADS}</span><span style="color: #2aa198;">/wine-</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_VER}</span><span style="color: #2aa198;">.tar.xz"</span> <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">Use this url for experimental version.</span>
<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">wget "http://dl.winehq.org/wine/source/${WINE_VER_MAJOR}.x/wine-${WINE_VER}.tar.xz" -O</span>
</pre>
</div>

<p>
Now, extract the tarball!
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #268bd2;">SRC_DIR</span>=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WORKSPACE}</span><span style="color: #2aa198;">/src"</span>
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #268bd2; font-weight: bold;">!</span> -d <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{SRC_DIR}</span><span style="color: #2aa198;">"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">mkdir</span> -pv <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{SRC_DIR}</span><span style="color: #2aa198;">"</span>
<span style="color: #859900; font-weight: bold;">fi</span>
tar xf <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{DOWNLOADS}</span><span style="color: #2aa198;">/wine-</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_VER}</span><span style="color: #2aa198;">.tar.xz"</span> -C <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{SRC_DIR}</span><span style="color: #2aa198;">"</span>
<span style="color: #268bd2;">WINE_SRC_DIR</span>=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{SRC_DIR}</span><span style="color: #2aa198;">/wine-</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_VER}</span><span style="color: #2aa198;">"</span>
</pre>
</div>
</div>
</div>
