docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.org
** Compiling Wine
As usual, we will install Wine on the Homebrew directory (default is =$HOME/.local=) so that we can manage it locally. We will compile 64 bit first to give reference to 32 bit configuration. After all, Windows runs both 32 bit and 64 bit core simultaneously, which makes compatibility with Linux or any UNIX like OS.

Good thing is, we are running this script on RHEL or CentOS or their clones. Ubuntu has some trouble with separating 64bit and 32bit libraries. In fact, Ubuntu does not even have =lib64= system directory but rather put everything into just =lib=, even in 64bit OS. This is not a bad thing since everything is migrating to 64bit architecture. We do not want to provide additional packages for deprecated 32bit architectures.

I believe [[https://www.winehq.org/][WineHq]] will find out how to mitigate this problem once almost all Linux distributions dropped 32bit support. Legacy codes always cause trouble, anyway.

#+begin_src shell :tangle Wine_on_RHEL.sh
WINE_BUILD_DIR_32="${WORKSPACE}/build/wine-${WINE_VER}-i686-build"
WINE_BUILD_DIR_64="${WORKSPACE}/build/wine-${WINE_VER}-x86_64-build"
if [ ! -d "$WORKSPACE/build" ]; then
	mkdir -pv "$WORKSPACE/build"
fi
mkdir -pv "$WINE_BUILD_DIR_32"
mkdir -pv "$WINE_BUILD_DIR_64"
#+end_src

Let's compile 64 bit Wine first...
#+begin_src shell :tangle Wine_on_RHEL.sh
echo "Configuring 64 bit Wine..."
cd "$WINE_BUILD_DIR_64" && CC="/usr/bin/gcc" CXX="/usr/bin/g++" CFLAGS="-O3 -march=native -pipe" CXXFLAGS="-O3 -march=native -pipe" LDFLAGS="-Wl,-rpath=$HOME/.local/lib -Wl,-rpath=$HOME/.local/lib64" "${WINE_SRC_DIR}/configure" \
	--prefix="$HOME/.local" --enable-win64 && cd "$CWD" 2>&1 >>$log
#+end_src

Let's just compile 64 bit wine.
#+begin_src shell :tangle Wine_on_RHEL.sh
echo "Building 64 bit Wine (Wine64)..."
cd "${WINE_BUILD_DIR_64}" && make -j$NPROCS && cd "${CWD}" 2>&1 >>$log
#+end_src

Now we need to supply correct environmental variables to the configure script. We'll just use my favorite rice up stuff. Note that gcc and g++ must be able to compile with =-m32= flag, or 32bit capable. We are sticking to the system gcc since installing those =i686= packages ensure 32bit code cross compilation.

#+begin_src shell :tangle Wine_on_RHEL.sh
echo "Configuring 32 bit Wine..."
cd "$WINE_BUILD_DIR_32" && CC="/usr/bin/gcc" CXX="/usr/bin/g++" CFLAGS="-O3 -march=native -pipe" CXXFLAGS="-O3 -march=native -pipe" LDFLAGS="-Wl,-rpath=$HOME/.local/lib" "${WINE_SRC_DIR}/configure" \
	--prefix="$HOME/.local" --with-wine64="${WINE_BUILD_DIR_64}" && cd "$CWD" 2>&1 >>$log
#+end_src

Once everything's configured, let's do the usual stuff!

#+begin_src shell :tangle Wine_on_RHEL.sh
echo "Building 32 bit Wine... and Installing it into prefix directory."
cd "${WINE_BUILD_DIR_32}" && make -j$NPROCS && make install 2>&1 >>$log
cd "${WINE_BUILD_DIR_64}" && make install 2>&1 >>$log
#+end_src

