docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.html

<div id="outline-container-orgb49c950" class="outline-3">
<h3 id="orgb49c950"><span class="section-number-3">1.4</span> Compiling Wine</h3>
<div class="outline-text-3" id="text-1-4">
<p>
As usual, we will install Wine on the Homebrew directory (default is <code>$HOME/.local</code>) so that we can manage it locally. We will compile 64 bit first to give reference to 32 bit configuration. After all, Windows runs both 32 bit and 64 bit core simultaneously, which makes compatibility with Linux or any UNIX like OS.
</p>

<p>
Good thing is, we are running this script on RHEL or CentOS or their clones. Ubuntu has some trouble with separating 64bit and 32bit libraries. In fact, Ubuntu does not even have <code>lib64</code> system directory but rather put everything into just <code>lib</code>, even in 64bit OS. This is not a bad thing since everything is migrating to 64bit architecture. We do not want to provide additional packages for deprecated 32bit architectures.
</p>

<p>
I believe <a href="https://www.winehq.org/">WineHq</a> will find out how to mitigate this problem once almost all Linux distributions dropped 32bit support. Legacy codes always cause trouble, anyway.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #268bd2;">WINE_BUILD_DIR_32</span>=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WORKSPACE}</span><span style="color: #2aa198;">/build/wine-</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_VER}</span><span style="color: #2aa198;">-i686-build"</span>
<span style="color: #268bd2;">WINE_BUILD_DIR_64</span>=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WORKSPACE}</span><span style="color: #2aa198;">/build/wine-</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_VER}</span><span style="color: #2aa198;">-x86_64-build"</span>
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">[</span> <span style="color: #268bd2; font-weight: bold;">!</span> -d <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">WORKSPACE</span><span style="color: #2aa198;">/build"</span> <span style="color: #268bd2;">]</span>; <span style="color: #859900; font-weight: bold;">then</span>
    <span style="color: #b58900; font-style: italic;">mkdir</span> -pv <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">WORKSPACE</span><span style="color: #2aa198;">/build"</span>
<span style="color: #859900; font-weight: bold;">fi</span>
<span style="color: #b58900; font-style: italic;">mkdir</span> -pv <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">WINE_BUILD_DIR_32</span><span style="color: #2aa198;">"</span>
<span style="color: #b58900; font-style: italic;">mkdir</span> -pv <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">WINE_BUILD_DIR_64</span><span style="color: #2aa198;">"</span>
</pre>
</div>

<p>
Let&rsquo;s compile 64 bit Wine first&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Configuring 64 bit Wine..."</span>
<span style="color: #b58900; font-style: italic;">cd</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">WINE_BUILD_DIR_64</span><span style="color: #2aa198;">"</span> &amp;&amp; <span style="color: #268bd2;">CC</span>=<span style="color: #2aa198;">"/usr/bin/gcc"</span> <span style="color: #268bd2;">CXX</span>=<span style="color: #2aa198;">"/usr/bin/g++"</span> <span style="color: #268bd2;">CFLAGS</span>=<span style="color: #2aa198;">"-O3 -march=native -pipe"</span> <span style="color: #268bd2;">CXXFLAGS</span>=<span style="color: #2aa198;">"-O3 -march=native -pipe"</span> <span style="color: #268bd2;">LDFLAGS</span>=<span style="color: #2aa198;">"-Wl,-rpath=</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">HOME</span><span style="color: #2aa198;">/.local/lib -Wl,-rpath=</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">HOME</span><span style="color: #2aa198;">/.local/lib64"</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_SRC_DIR}</span><span style="color: #2aa198;">/configure"</span> <span style="color: #2aa198;">\</span>
    --prefix=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">HOME</span><span style="color: #2aa198;">/.local"</span> --enable-win64 &amp;&amp; <span style="color: #b58900; font-style: italic;">cd</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">CWD</span><span style="color: #2aa198;">"</span> <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
</pre>
</div>

<p>
Let&rsquo;s just compile 64 bit wine.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Building 64 bit Wine (Wine64)..."</span>
<span style="color: #b58900; font-style: italic;">cd</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_BUILD_DIR_64}</span><span style="color: #2aa198;">"</span> &amp;&amp; <span style="color: #b58900; font-style: italic;">make</span> -j4 &amp;&amp; <span style="color: #b58900; font-style: italic;">cd</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{CWD}</span><span style="color: #2aa198;">"</span> <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
</pre>
</div>

<p>
Now we need to supply correct environmental variables to the configure script. We&rsquo;ll just use my favorite rice up stuff. Note that gcc and g++ must be able to compile with <code>-m32</code> flag, or 32bit capable. We are sticking to the system gcc since installing those <code>i686</code> packages ensure 32bit code cross compilation.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Configuring 32 bit Wine..."</span>
<span style="color: #b58900; font-style: italic;">cd</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">WINE_BUILD_DIR_32</span><span style="color: #2aa198;">"</span> &amp;&amp; <span style="color: #268bd2;">CC</span>=<span style="color: #2aa198;">"/usr/bin/gcc"</span> <span style="color: #268bd2;">CXX</span>=<span style="color: #2aa198;">"/usr/bin/g++"</span> <span style="color: #268bd2;">CFLAGS</span>=<span style="color: #2aa198;">"-O3 -march=native -pipe"</span> <span style="color: #268bd2;">CXXFLAGS</span>=<span style="color: #2aa198;">"-O3 -march=native -pipe"</span> <span style="color: #268bd2;">LDFLAGS</span>=<span style="color: #2aa198;">"-Wl,-rpath=</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">HOME</span><span style="color: #2aa198;">/.local/lib"</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_SRC_DIR}</span><span style="color: #2aa198;">/configure"</span> <span style="color: #2aa198;">\</span>
    --prefix=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">HOME</span><span style="color: #2aa198;">/.local"</span> --with-wine64=<span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_BUILD_DIR_64}</span><span style="color: #2aa198;">"</span> &amp;&amp; <span style="color: #b58900; font-style: italic;">cd</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">CWD</span><span style="color: #2aa198;">"</span> <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
</pre>
</div>

<p>
Once everything&rsquo;s configured, let&rsquo;s do the usual stuff!
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Building 32 bit Wine... and Installing it into prefix directory."</span>
<span style="color: #b58900; font-style: italic;">cd</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_BUILD_DIR_32}</span><span style="color: #2aa198;">"</span> &amp;&amp; <span style="color: #b58900; font-style: italic;">make</span> -j <span style="color: #6c71c4; font-weight: bold;">4</span> &amp;&amp; <span style="color: #b58900; font-style: italic;">make</span> install <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
<span style="color: #b58900; font-style: italic;">cd</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">{WINE_BUILD_DIR_64}</span><span style="color: #2aa198;">"</span> &amp;&amp; <span style="color: #b58900; font-style: italic;">make</span> install <span style="color: #6c71c4; font-weight: bold;">2</span>&gt;&amp;<span style="color: #6c71c4; font-weight: bold;">1</span> &gt;&gt;$<span style="color: #268bd2;">log</span>
</pre>
</div>
</div>
</div>
