docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.org
** Wine Gecko and Mono
>>> Disabled for now. <<<
--> Wine actually tries to install them automatically.

Wine has additional dependencies to run many programs properly. This section actually limits the version of Wine to be installed. Those two packages are super sensitive to version matching...

Let's install Wine Mono...
#+begin_src shell :tangle Wine_on_RHEL.sh
# wget https://dl.winehq.org/wine/wine-mono/6.0.0/wine-mono-6.0.0-x86.msi -O "$DOWNLOADS/wine-mono-6.0.0-x86.msi"
# wine msiexec /i $DOWNLOADS/wine-mono-6.0.0-x86.msi
#+end_src

#+RESULTS:

And Wine Gecko
#+begin_src shell :tangle Wine_on_RHEL.sh
#wget http://dl.winehq.org/wine/wine-gecko/2.47.2/wine-gecko-2.47.2-x86.msi -O "$DOWNLOADS/wine-gecko-2.47.2-x86.msi"
#wine msiexec /i $DOWNLOADS/wine-gecko-2.47.2-x86.msi
#wget http://dl.winehq.org/wine/wine-gecko/2.47.2/wine-gecko-2.47.2-x86_64.msi -O "$DOWNLOADS/wine-gecko-2.47.2-x86_64.msi"
#wine msiexec /i $DOWNLOADS/wine-gecko-2.47.2-x86_64.msi
#+end_src


** Closing up
If the compilation does not confront more hiccups, it will end up wine executable at =$HOME/.local/bin=. Now let's try to install [[https://www.analog.com/en/design-center/design-tools-and-calculators/ltspice-simulator.html][LTSpice]] with it!

Then clean up everything! (Not mandatory)
#+begin_src shell :tangle Wine_on_RHEL.sh
#rm -rf "${WORKSPACE}"
#echo "Cleaned up all the build craps! Consider installing Winetricks."
#+end_src

Checking up installed wine.
#+begin_src shell :tangle Wine_on_RHEL.sh
echo "Checking the installation results..."
echo "Wine 32 bit is..."
file "$(command -v wine)"
echo "Wine 32 bit version is:"
wine --version
echo
echo "Wine 64 bit is..."
file "$(command -v wine64)"
echo "Wine 64 bit version is:"
wine64 --version
#+end_src

Also, consider installing Winetricks! It will help you install all the interesting packages easily.

* Winetricks
Apparently, installing wine itself isn't really enough. We need to install more stuffs such as Windows fonts and Visual Studio .Net Runtime, blah blah stuffs. So, Installing [[https://wiki.winehq.org/Winetricks][Winetricks]] is a must!

#+begin_src shell :tangle Winetricks.sh
#!/usr/bin/env bash -e

CWD=$(pwd -P)

mkdir -pv "$CWD/workspace/downloads"
wget https://raw.githubusercontent.com/Winetricks/winetricks/master/src/winetricks -O "$CWD/workspace/downloads/winetricks"
chmod +x "$CWD/workspace/downloads/winetricks"
cp "$CWD/workspace/downloads/winetricks" "$HOME/.local/bin/winetricks"
#+end_src

Now run =winetricks= on your shell. It will detect system installed wine automatically and set up =~/.wine= directory accordingly. The 64bit version might involve a bit of error messages during operation but you can turn on 'silent install' mode anytime.


* Korean Fonts
This is not really a troublesome feature if you do not speak Korean nor have to use any Korean UI programs. But Wine in default set up, does not brings in any Korean fonts and unable to display any EUC_KR encoded fonts. This is because the default wine installation do not come with CJK fonts. These fonts can be installed via the winetricks! Install fakekorean, cjkfonts, and tahoma.

Also, you can put in font files to =~/.wine/drive_c/windows/fonts= directory. Yes, if you have copied font files from any Windows machine, it will work flawlessly with the wine as well. Note that =Gulim= is the best selection for wine's default Windows theme!

Once you have successfully installed those Korean fonts, open =~/.wine/system.reg= to edit a couple of lines. Search ="MS Shell Dlg"= and ="MS Shell Dlg 2"= to replace those settings to =Gulim= and =Tahoma=!! Then it will show Korean fonts correctly!!

This part was referenced from [[https://blog.danggun.net/3661][Danggun's Blog]].
