docs/Wine_on_RHEL/Install_Wine_on_RHEL_8_3.html

<div id="outline-container-orge7a3534" class="outline-3">
<h3 id="orge7a3534"><span class="section-number-3">1.5</span> Wine Gecko and Mono</h3>
<div class="outline-text-3" id="text-1-5">
<p>
&gt;&gt;&gt; Disabled for now. &lt;&lt;&lt;
&#x2013;&gt; Wine actually tries to install them automatically.
</p>

<p>
Wine has additional dependencies to run many programs properly. This section actually limits the version of Wine to be installed. Those two packages are super sensitive to version matching&#x2026;
</p>

<p>
Let&rsquo;s install Wine Mono&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">wget https://dl.winehq.org/wine/wine-mono/6.0.0/wine-mono-6.0.0-x86.msi -O "$DOWNLOADS/wine-mono-6.0.0-x86.msi"</span>
<span style="color: #96A7A9; font-style: italic;"># </span><span style="color: #96A7A9; font-style: italic;">wine msiexec /i $DOWNLOADS/wine-mono-6.0.0-x86.msi</span>
</pre>
</div>

<p>
And Wine Gecko
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">wget http://dl.winehq.org/wine/wine-gecko/2.47.2/wine-gecko-2.47.2-x86.msi -O "$DOWNLOADS/wine-gecko-2.47.2-x86.msi"</span>
<span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">wine msiexec /i $DOWNLOADS/wine-gecko-2.47.2-x86.msi</span>
<span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">wget http://dl.winehq.org/wine/wine-gecko/2.47.2/wine-gecko-2.47.2-x86_64.msi -O "$DOWNLOADS/wine-gecko-2.47.2-x86_64.msi"</span>
<span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">wine msiexec /i $DOWNLOADS/wine-gecko-2.47.2-x86_64.msi</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc172d2b" class="outline-3">
<h3 id="orgc172d2b"><span class="section-number-3">1.6</span> Closing up</h3>
<div class="outline-text-3" id="text-1-6">
<p>
If the compilation does not confront more hiccups, it will end up wine executable at <code>$HOME/.local/bin</code>. Now let&rsquo;s try to install <a href="https://www.analog.com/en/design-center/design-tools-and-calculators/ltspice-simulator.html">LTSpice</a> with it!
</p>

<p>
Then clean up everything! (Not mandatory)
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">rm</span><span style="color: #96A7A9; font-style: italic;"> -rf "${WORKSPACE}"</span>
<span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">echo</span><span style="color: #96A7A9; font-style: italic;"> "Cleaned up all the build craps! Consider installing Winetricks."</span>
</pre>
</div>

<p>
Checking up installed wine.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Checking the installation results..."</span>
<span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Wine 32 bit is..."</span>
file <span style="color: #2aa198;">"</span><span style="color: #268bd2; font-weight: bold;">$(command -v wine)</span><span style="color: #2aa198;">"</span>
<span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Wine 32 bit version is:"</span>
wine --version
<span style="color: #b58900; font-style: italic;">echo</span>
<span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Wine 64 bit is..."</span>
file <span style="color: #2aa198;">"</span><span style="color: #268bd2; font-weight: bold;">$(command -v wine64)</span><span style="color: #2aa198;">"</span>
<span style="color: #b58900; font-style: italic;">echo</span> <span style="color: #2aa198;">"Wine 64 bit version is:"</span>
wine64 --version
</pre>
</div>

<p>
Also, consider installing Winetricks! It will help you install all the interesting packages easily.
</p>
</div>
</div>
</div>

<div id="outline-container-org70c95a4" class="outline-2">
<h2 id="org70c95a4"><span class="section-number-2">2</span> Winetricks</h2>
<div class="outline-text-2" id="text-2">
<p>
Apparently, installing wine itself isn&rsquo;t really enough. We need to install more stuffs such as Windows fonts and Visual Studio .Net Runtime, blah blah stuffs. So, Installing <a href="https://wiki.winehq.org/Winetricks">Winetricks</a> is a must!
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #96A7A9; font-style: italic;">#</span><span style="color: #96A7A9; font-style: italic;">!/usr/bin/</span><span style="color: #859900; font-weight: bold;">env</span><span style="color: #96A7A9; font-style: italic;"> bash -e</span>

<span style="color: #268bd2;">CWD</span>=$<span style="color: #268bd2;">(</span><span style="color: #b58900; font-style: italic;">pwd</span> -P<span style="color: #268bd2;">)</span>

<span style="color: #b58900; font-style: italic;">mkdir</span> -pv <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">CWD</span><span style="color: #2aa198;">/workspace/downloads"</span>
wget https://raw.githubusercontent.com/Winetricks/winetricks/master/src/winetricks -O <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">CWD</span><span style="color: #2aa198;">/workspace/downloads/winetricks"</span>
<span style="color: #b58900; font-style: italic;">chmod</span> +x <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">CWD</span><span style="color: #2aa198;">/workspace/downloads/winetricks"</span>
<span style="color: #b58900; font-style: italic;">cp</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">CWD</span><span style="color: #2aa198;">/workspace/downloads/winetricks"</span> <span style="color: #2aa198;">"</span><span style="color: #6c71c4; font-weight: bold;">$</span><span style="color: #268bd2;">HOME</span><span style="color: #2aa198;">/.local/bin/winetricks"</span>
</pre>
</div>

<p>
Now run <code>winetricks</code> on your shell. It will detect system installed wine automatically and set up <code>~/.wine</code> directory accordingly. The 64bit version might involve a bit of error messages during operation but you can turn on &rsquo;silent install&rsquo; mode anytime.
</p>
</div>
</div>


<div id="outline-container-org762a846" class="outline-2">
<h2 id="org762a846"><span class="section-number-2">3</span> Korean Fonts</h2>
<div class="outline-text-2" id="text-3">
<p>
This is not really a troublesome feature if you do not speak Korean nor have to use any Korean UI programs. But Wine in default set up, does not brings in any Korean fonts and unable to display any EUC<sub>KR</sub> encoded fonts. This is because the default wine installation do not come with CJK fonts. These fonts can be installed via the winetricks! Install fakekorean, cjkfonts, and tahoma.
</p>

<p>
Also, you can put in font files to <code>~/.wine/drive_c/windows/fonts</code> directory. Yes, if you have copied font files from any Windows machine, it will work flawlessly with the wine as well. Note that <code>Gulim</code> is the best selection for wine&rsquo;s default Windows theme!
</p>

<p>
Once you have successfully installed those Korean fonts, open <code>~/.wine/system.reg</code> to edit a couple of lines. Search <code>"MS Shell Dlg"</code> and <code>"MS Shell Dlg 2"</code> to replace those settings to <code>Gulim</code> and <code>Tahoma</code>!! Then it will show Korean fonts correctly!!
</p>

<p>
This part was referenced from <a href="https://blog.danggun.net/3661">Danggun&rsquo;s Blog</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Taylor Shin</p>
<p class="date">Created: 2021-04-12 Mon 22:41</p>
</div>
</body>
</html>
